const groupByPart = (obj) => {
  const regionMap = {
    "АР Крим": "Південь",
    "Вінницька обл.": "Центр",
    "Волинська обл.": "Захід",
    "Дніпропетровська обл.": "Схід",
    "Житомирська обл.": "Північ",
    "Закарпатська обл.": "Захід",
    "Запорізька обл.": "Схід",
    "Івано-Франківська обл.": "Захід",
    "Київська обл.": "Північ",
    "Кіровоградська обл.": "Центр",
    "Луганська обл.": "Схід",
    "Львівська обл.": "Захід",
    "Миколаївська обл.": "Південь",
    "Одеська обл.": "Південь",
    "Полтавська обл.": "Центр",
    "Рівненська обл.": "Захід",
    "Сумська обл.": "Північ",
    "Тернопільська обл.": "Захід",
    "Харківська обл.": "Схід",
    "Херсонська обл.": "Південь",
    "Хмельницька обл.": "Захід",
    "Черкаська обл.": "Центр",
    "Чернівецька обл.": "Захід",
    "Чернігівська обл.": "Північ"
  };

  const result = {};

  for (const region in obj) {
    const mapRegion = regionMap[region] || region;
    if (!result[mapRegion]) {
      result[mapRegion] = {};
    }
    result[mapRegion][region] = obj[region];
  }

  return result;
}

export default groupByPart;